{
    "experiences": [
        {
            "title": "Software Engineer Intern",
            "subtitle": "iHerb, LLC",
            "workType": "Full-time",
            "workDescription": [
                "Currently part of Transportation Management System (TMS) team, focusing on code migration and API development, streamlining deployment processes and improving scalability"
            ],
            "dateText": "06/2024 – Present"
        },
        {
            "title": "Graduate Student Researcher",
            "subtitle": "Computational Communication Research Lab (C2 lab or C-square lab) - UC Davis",
            "workType": "Full-time",
            "workDescription": [
                "Led the enhancement of content moderation on YouTube using AI-based classifiers and Large Language Models, increasing harmful content detection accuracy from 54% to 88%. Advanced BERT baseline models with few-shot learning, integrating techniques such as Proto++, triplet loss, reduction, and induction networks to optimize model performance"
            ],
            "dateText": "04/2024 – Present"
        },
        {
            "title": "Graduate Teaching Assistant",
            "subtitle": "UC Davis",
            "workType": "Full-time",
            "workDescription": [
                "Led discussion sections for courses in Computer Architecture and Web Programming, accommodating over 100 students. Provided one-on-one mentoring, designed quizzes, facilitated group activities, and graded assignments for feedback and improvement"
            ],
            "dateText": "10/2023 – Present"
        },
        {
            "title": "Lead Instructor",
            "subtitle": "Knowledge Streams",
            "workType": "Full-time",
            "workDescription": [
                "Instructed 60 students as a Data Science Instructor at Knowledge Streams, mentoring them in project work, using interactive exercises and assignments for active learning"
            ],
            "dateText": "06/2023 – 10/2023"
        },
        {
            "title": "Research Software Engineer",
            "subtitle": "Internet Security and Privacy Lab - LUMS",
            "workType": "Full-time",
            "workDescription": [
                "Research focused on enhancing anomaly detection, developed a TensorFlow autoencoder with Graph Convolutional Networks that detects anomalies during software installations with 94.3% accuracy. Analyzed vulnerabilities in containerized apps, emphasizing Container Escape Attacks, and optimized graph-based models using Word2Vec for node embeddings. Additionally, streamlined log processing, reducing time by 30%"
            ],
            "dateText": "07/2022 – 06/2023"
        },
        {
            "title": "Software Development Intern",
            "subtitle": "Techloyce",
            "workType": "Full-time",
            "workDescription": [
                "Contributed to the development of the 'SubscriptionFlow' B2B product, enhancing its functionality and improving customer transaction efficiency. Optimized app performance by implementing cache storage and streamlining the search and filter features, which reduced data retrieval times by 70%. Worked collaboratively with cross-functional teams to refine the codebase using Angular and Ionic, minimizing latency and enhancing the user interface"
            ],
            "dateText": "06/2022 – 09/2022"
        }
    ]
}